platformio/platform-ststm32/misc/svd/STM32WB35_CM4.svd
            <register>
               <name>AHB2ENR</name>
               <displayName>AHB2ENR</displayName>
               <description>AHB2 peripheral clock enable           register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES1EN</name>
                     <description>AES1 accelerator clock               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCEN</name>
                     <description>ADC clock enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOHEN</name>
                     <description>IO port H clock enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOEEN</name>
                     <description>IO port E clock enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIODEN</name>
                     <description>IO port D clock enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOCEN</name>
                     <description>IO port C clock enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOBEN</name>
                     <description>IO port B clock enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOAEN</name>
                     <description>IO port A clock enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB3ENR</name>
               <displayName>AHB3ENR</displayName>
               <description>AHB3 peripheral clock enable           register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02080000</resetValue>
               <fields>
                  <field>
                     <name>FLASHEN</name>
                     <description>FLASHEN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPCCEN</name>
                     <description>IPCCEN</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSEMEN</name>
                     <description>HSEMEN</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNGEN</name>
                     <description>RNGEN</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES2EN</name>
                     <description>AES2EN</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKAEN</name>
                     <description>PKAEN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QSPIEN</name>
                     <description>QSPIEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1ENR1</name>
               <displayName>APB1ENR1</displayName>
               <description>APB1ENR1</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000400</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1EN</name>
                     <description>CPU1 Low power timer 1 clock               enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBEN</name>
                     <description>CPU1 USB clock enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRSEN</name>
                     <description>CPU1 CRS clock enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3EN</name>
                     <description>CPU1 I2C3 clock enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1EN</name>
                     <description>CPU1 I2C1 clock enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2EN</name>
                     <description>CPU1 SPI2 clock enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGEN</name>
                     <description>CPU1 Window watchdog clock               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCAPBEN</name>
                     <description>CPU1 RTC APB clock enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCDEN</name>
                     <description>CPU1 LCD clock enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM2EN</name>
                     <description>CPU1 TIM2 timer clock               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1ENR2</name>
               <displayName>APB1ENR2</displayName>
               <description>APB1 peripheral clock enable register           2</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPTIM2EN</name>
                     <description>CPU1 LPTIM2EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1EN</name>
                     <description>CPU1 Low power UART 1 clock               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB2ENR</name>
               <displayName>APB2ENR</displayName>
               <description>APB2ENR</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SAI1EN</name>
                     <description>CPU1 SAI1 clock enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM17EN</name>
                     <description>CPU1 TIM17 timer clock               enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM16EN</name>
                     <description>CPU1 TIM16 timer clock               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1EN</name>
                     <description>CPU1 USART1clock enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1EN</name>
                     <description>CPU1 SPI1 clock enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM1EN</name>
                     <description>CPU1 TIM1 timer clock               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB1SMENR</name>
               <displayName>AHB1SMENR</displayName>
               <description>AHB1 peripheral clocks enable in Sleep and           Stop modes register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00011207</resetValue>
               <fields>
                  <field>
                     <name>TSCSMEN</name>
                     <description>CPU1 Touch Sensing Controller clocks               enable during Sleep and Stop modes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCSMEN</name>
                     <description>CPU1 CRCSMEN</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM1SMEN</name>
                     <description>CPU1 SRAM1 interface clocks enable               during Sleep and Stop modes</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAMUXSMEN</name>
                     <description>CPU1 DMAMUX clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2SMEN</name>
                     <description>CPU1 DMA2 clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1SMEN</name>
                     <description>CPU1 DMA1 clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB2SMENR</name>
               <displayName>AHB2SMENR</displayName>
               <description>AHB2 peripheral clocks enable in Sleep and           Stop modes register</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0001209F</resetValue>
               <fields>
                  <field>
                     <name>AES1SMEN</name>
                     <description>CPU1 AES1 accelerator clocks enable               during Sleep and Stop modes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCFSSMEN</name>
                     <description>CPU1 ADC clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOHSMEN</name>
                     <description>CPU1 IO port H clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOESMEN</name>
                     <description>CPU1 IO port E clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIODSMEN</name>
                     <description>CPU1 IO port D clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOCSMEN</name>
                     <description>CPU1 IO port C clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOBSMEN</name>
                     <description>CPU1 IO port B clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOASMEN</name>
                     <description>CPU1 IO port A clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB3SMENR</name>
               <displayName>AHB3SMENR</displayName>
               <description>AHB3 peripheral clocks enable in Sleep and           Stop modes register</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x03070100</resetValue>
               <fields>
                  <field>
                     <name>FLASHSMEN</name>
                     <description>Flash interface clocks enable during               CPU1 sleep mode</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM2SMEN</name>
                     <description>SRAM2a and SRAM2b memory interface               clocks enable during CPU1 sleep mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNGSMEN</name>
                     <description>True RNG clocks enable during CPU1 sleep               mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES2SMEN</name>
                     <description>AES2 accelerator clocks enable during               CPU1 sleep mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKASMEN</name>
                     <description>PKA accelerator clocks enable during               CPU1 sleep mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QSPISMEN</name>
                     <description>QSPISMEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1SMENR1</name>
               <displayName>APB1SMENR1</displayName>
               <description>APB1SMENR1</description>
               <addressOffset>0x78</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x85A04E01</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1SMEN</name>
                     <description>Low power timer 1 clocks enable during               CPU1 Sleep mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBSMEN</name>
                     <description>USB FS clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRSMEN</name>
                     <description>CRS clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SMEN</name>
                     <description>I2C3 clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SMEN</name>
                     <description>I2C1 clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2SMEN</name>
                     <description>SPI2 clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGSMEN</name>
                     <description>Window watchdog clocks enable during               CPU1 Sleep mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCAPBSMEN</name>
                     <description>RTC APB clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCDSMEN</name>
                     <description>LCD clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM2SMEN</name>
                     <description>TIM2 timer clocks enable during CPU1               Sleep mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1SMENR2</name>
               <displayName>APB1SMENR2</displayName>
               <description>APB1 peripheral clocks enable in Sleep and           Stop modes register 2</description>
               <addressOffset>0x7C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000021</resetValue>
               <fields>
                  <field>
                     <name>LPTIM2SMEN</name>
                     <description>Low power timer 2 clocks enable during               CPU1 Sleep mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SMEN</name>
                     <description>Low power UART 1 clocks enable during               CPU1 Sleep mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
