platformio/platform-ststm32/misc/svd/STM32WB35_CM4.svd
            <register>
               <name>APB2SMENR</name>
               <displayName>APB2SMENR</displayName>
               <description>APB2SMENR</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00265800</resetValue>
               <fields>
                  <field>
                     <name>SAI1SMEN</name>
                     <description>SAI1 clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM17SMEN</name>
                     <description>TIM17 timer clocks enable during CPU1               Sleep mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM16SMEN</name>
                     <description>TIM16 timer clocks enable during CPU1               Sleep mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1SMEN</name>
                     <description>USART1clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1SMEN</name>
                     <description>SPI1 clocks enable during CPU1 Sleep               mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM1SMEN</name>
                     <description>TIM1 timer clocks enable during CPU1               Sleep mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCIPR</name>
               <displayName>CCIPR</displayName>
               <description>CCIPR</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RNGSEL</name>
                     <description>RNG clock source selection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ADCSEL</name>
                     <description>ADCs clock source               selection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CLK48SEL</name>
                     <description>48 MHz clock source               selection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SAI1SEL</name>
                     <description>SAI1 clock source               selection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM2SEL</name>
                     <description>Low power timer 2 clock source               selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM1SEL</name>
                     <description>Low power timer 1 clock source               selection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SEL</name>
                     <description>I2C3 clock source               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SEL</name>
                     <description>I2C1 clock source               selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SEL</name>
                     <description>LPUART1 clock source               selection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>USART1SEL</name>
                     <description>USART1 clock source               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDCR</name>
               <displayName>BDCR</displayName>
               <description>BDCR</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSCOSEL</name>
                     <description>Low speed clock output               selection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSCOEN</name>
                     <description>Low speed clock output               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BDRST</name>
                     <description>Backup domain software               reset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCEN</name>
                     <description>RTC clock enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCSEL</name>
                     <description>RTC clock source selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSECSSD_</name>
                     <description>CSS on LSE failure               detection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSECSSON</name>
                     <description>LSECSSON</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSEDRV</name>
                     <description>SE oscillator drive               capability</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSEBYP</name>
                     <description>LSE oscillator bypass</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSERDY</name>
                     <description>LSE oscillator ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSEON</name>
                     <description>LSE oscillator enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>CSR</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <resetValue>0x0C000000</resetValue>
               <fields>
                  <field>
                     <name>LPWRRSTF</name>
                     <description>Low-power reset flag</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WWDGRSTF</name>
                     <description>Window watchdog reset flag</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IWDGRSTF</name>
                     <description>Independent window watchdog reset               flag</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SFTRSTF</name>
                     <description>Software reset flag</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BORRSTF</name>
                     <description>BOR flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PINRSTF</name>
                     <description>Pin reset flag</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OBLRSTF</name>
                     <description>Option byte loader reset               flag</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RMVF</name>
                     <description>Remove reset flag</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RFWKPSEL</name>
                     <description>RF system wakeup clock source               selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSI2BW</name>
                     <description>LSI2 oscillator bias               configuration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSI2TRIMOK</name>
                     <description>LSI2 oscillator trim OK</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSI2TRIMEN</name>
                     <description>LSI2 oscillator trimming               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSI2RDY</name>
                     <description>LSI2 oscillator ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSI2ON</name>
                     <description>LSI2 oscillator enabled</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSI1RDY</name>
                     <description>LSI1 oscillator ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LSI1ON</name>
                     <description>LSI1 oscillator enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RFRSTS</name>
                     <description>Radio system BLE and 802.15.4 reset               status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRRCR</name>
               <displayName>CRRCR</displayName>
               <description>Clock recovery RC register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HSI48CAL</name>
                     <description>HSI48 clock calibration</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>9</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSI48RDY</name>
                     <description>HSI48 clock ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSI48ON</name>
                     <description>HSI48 oscillator enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSECR</name>
               <displayName>HSECR</displayName>
               <description>Clock HSE register</description>
               <addressOffset>0x9C</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000030</resetValue>
               <fields>
                  <field>
                     <name>HSETUNE</name>
                     <description>HSE capacitor tuning</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSEGMC</name>
                     <description>HSE current control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSES</name>
                     <description>HSE Sense amplifier               threshold</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UNLOCKED</name>
                     <description>Register lock system</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTCFGR</name>
               <displayName>EXTCFGR</displayName>
               <description>Extended clock recovery           register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <resetValue>0x00030000</resetValue>
               <fields>
                  <field>
                     <name>RFCSS</name>
                     <description>RF clock source selected</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C2HPREF</name>
                     <description>CPU2 AHB prescaler flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SHDHPREF</name>
                     <description>Shared AHB prescaler flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C2HPRE</name>
                     <description>CPU2 AHB prescaler</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SHDHPRE</name>
                     <description>Shared AHB prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2AHB1ENR</name>
               <displayName>C2AHB1ENR</displayName>
               <description>CPU2 AHB1 peripheral clock enable           register</description>
               <addressOffset>0x148</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSCEN</name>
                     <description>CPU2 Touch Sensing Controller clock               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCEN</name>
                     <description>CPU2 CRC clock enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM1EN</name>
                     <description>CPU2 SRAM1 clock enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAMUXEN</name>
                     <description>CPU2 DMAMUX clock enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2EN</name>
                     <description>CPU2 DMA2 clock enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1EN</name>
                     <description>CPU2 DMA1 clock enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
